Revit 2027 API
Alignment.Get(Element) Method
 Returns an Alignment object given a Revit alignment element.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static Alignment Get(
	Element alignmentElement
)
Public Shared Function Get (
	alignmentElement As Element
) As Alignment
public:
static Alignment^ Get(
	Element^ alignmentElement
)
static member Get :
        alignmentElement : Element -> Alignment
Parameters
alignmentElement Element
The alignment element.
Return Value
Alignment
An Alignment for this element, or null if none found.
See Also
Reference
Alignment Class
Get Overload
Autodesk.Revit.DB.Infrastructure Namespace